#    -*- mode: org -*-


Archived entries from file /home/me/src/helm-org-rifle/notes.org


* DONE Match and show tags
CLOSED: [2016-03-28 Mon 19:34]
:LOGBOOK:
- State "DONE"       from "UNDERWAY"   [2016-03-28 Mon 19:34]
- State "UNDERWAY"   from "DONE"       [2016-03-28 Mon 19:31]
- State "DONE"       from "TODO"       [2016-03-28 Mon 17:30]
:END:
:PROPERTIES:
:ARCHIVE_TIME: 2016-04-02 Sat 04:50
:ARCHIVE_FILE: ~/src/helm-org-rifle/notes.org
:ARCHIVE_CATEGORY: notes
:ARCHIVE_TODO: DONE
:ARCHIVE_OLPATH: Code
:END:

This should show both this heading and the target:

#+BEGIN_SRC elisp :results value
(let ((helm-org-rifle-show-tags t))
        (helm-org-rifle-get-candidates-in-buffer (current-buffer) "charade"))
#+END_SRC

#+RESULTS:
| *** Target heading for tags test :charade:                                                            | 34684 |
| ** TODO Match and show tags buffer (current-buffer) "charade"))...buffer (current-buffer) "charade")) | 34242 |

This should show only this heading:

#+BEGIN_SRC elisp :results value
  (let ((helm-org-rifle-show-tags nil))
        (helm-org-rifle-get-candidates-in-buffer (current-buffer) "charade"))
#+END_SRC

#+RESULTS:
| ** TODO Match and show tags buffer (current-buffer) "charade"))...t heading for tags test :charade: ...buffer (current-buffer) "charade"))...buffer (current-buf...buffer (current-buffer) "charade")) | 34242 |

** Fontify tags correctly

Tags are being fontified just like the rest of the heading text, instead of like tags.

#+BEGIN_SRC elisp
  (helm-org-rifle-fontify-like-in-org-mode (s-join " " (list "*"
                                                             "Heading"
                                                             ":tag1:tag2:")))
#+END_SRC

#+RESULTS:
:  * Heading :tag1:tag2:

Seems like there needs to be whitespace after the tag string to make it appear in the =org-tag= face.

#+BEGIN_SRC elisp
  (helm-org-rifle-fontify-like-in-org-mode (s-join " " (list "*"
                                                             "Heading"
                                                             ":tag1:tag2: ")))
#+END_SRC

#+RESULTS:
: * Heading :tag1:tag2:

** Match headings with multiple tags

Now it matches headings with one tag, but not more than one.

#+BEGIN_SRC elisp :results value
(let ((helm-org-rifle-show-tags t))
        (helm-org-rifle-get-candidates-in-buffer (current-buffer) ":gunn:"))
#+END_SRC

Maybe this will help, from =org.el=

#+BEGIN_SRC elisp
(org-re "\\(?:[ \t]+\\(:[[:alnum:]_@#%%:]+:\\)\\)?")
#+END_SRC

#+BEGIN_SRC elisp :results list
  (let ((helm-org-rifle-show-tags t)
        (helm-org-rifle-tags-re (org-re "\\(?:[ \t]+\\(:[[:alnum:]_@#%%:]+:\\)\\)?")))
    (--map (substring-no-properties (car it))  (helm-org-rifle-get-candidates-in-buffer (current-buffer) ":gunn:")))
#+END_SRC

Yeah, using that regexp from =org-complex-heading-regexp-format= in =org.el= seems to work.  Whew.

But this is the more correct one I think:

[[file:~/tmp/src/org-mode/lisp/org.el::(let%20((tag-re%20(concat%20org-outline-regexp-bol][re in org.el]]:

#+BEGIN_SRC elisp
  (let ((tag-re (concat org-outline-regexp-bol
                        "\\(?:.*?[ \t]\\)?"
                        (org-re ":\\([[:alnum:]_@#%:]+\\):[ \t]*$")))
        (targets (list ":yes:" "no")))
    (mapcar (it (when (string-match tag-re it)
                  (match-string 0 it))) targets))
#+END_SRC

#+RESULTS:
| :yes: | nil |

And this more minimal one seems to work too:

#+BEGIN_SRC elisp
  (let ((tag-re (org-re ":\\([[:alnum:]_@#%:]+\\):[ \t]*$"))
        (targets (list ":yes:" "location" ":tag:" "notatag")))
    (mapcar (it (when (string-match tag-re it)
                  (match-string 0 it))) targets))
#+END_SRC

#+RESULTS:
| :yes: | nil | :tag: | nil |

#+BEGIN_SRC elisp
  (let ((tag-re helm-org-rifle-tags-re)
        (targets (list ":yes:" "location" ":tag:" "notatag" ":website:Emacs:")))
    (mapcar (it (when (string-match tag-re it)
                  (match-string 0 it))) targets))
#+END_SRC

#+RESULTS:
| :yes: | nil | :tag: | nil |

** Find negation patterns

#+BEGIN_SRC elisp
(mapcar (it (helm-org-rifle-prep-token it)) '("notatag" ":tag:"))

#+END_SRC

#+RESULTS:
| \(\(?:[ \n]+\(:[[:alnum:]_@#%%:]+:\)\)?\ | \)notatag\(\(?:[ \n]+\(:[[:alnum:]_@#%%:]+:\)\)?\ | \ | $\) | \(\(?:[ \n]+\(:[[:alnum:]_@#%%:]+:\)\)?\ | \):tag:\(\(?:[ \n]+\(:[[:alnum:]_@#%%:]+:\)\)?\ | \ | $\) |

#+BEGIN_SRC elisp
  (mapit '("notatag" ":tag:") (string-match helm-org-rifle-tags-re it))
#+END_SRC

#+RESULTS:
| 0 | 0 |

#+BEGIN_SRC elisp
  (let ((helm-org-rifle-tags-re (org-re ":\\([[:alnum:]_@#%:]+\\):[ \t]*$")))
    (mapit '("notatag" ":tag:") (string-match helm-org-rifle-tags-re it)))
#+END_SRC

#+RESULTS:

#+BEGIN_SRC elisp :results list
  (let* ((input (split-string "summertime !difficult easy" " " t))
         (negations (delq nil (mapcar (lambda (token)
                                        (when (string-match "^!" token)
                                          (setq input (remove token input))
                                          (helm-org-rifle-prep-token (s-chop-prefix "!" token))))
                                      input))))
    (list input negations))
#+END_SRC

#+RESULTS:
- ("summertime" "easy")
- ("\\(\\_<\\|[[:punct:]]\\)difficult\\(\\_>\\|[[:punct:]]\\)")

** Avoid partial negation

e.g. searching for =location !cat= should not exclude results containing =location=.

This should return the =Target positive: location= heading:

#+BEGIN_SRC elisp :results list
  (let ((helm-org-rifle-show-tags t))
    (mapit (helm-org-rifle-get-candidates-in-buffer (current-buffer) "location !ca ")
           (s-replace "\n" "" (s-collapse-whitespace (org-no-properties (car it))))))
#+END_SRC

#+RESULTS:
- **** Target positive: location 
- *** Match headings with multiple tags (targets (list ":yes:" "location" ":tag:" "notatag")))

This should not return that heading:

#+BEGIN_SRC elisp :results list
  (let ((helm-org-rifle-show-tags t))
    (mapit (helm-org-rifle-get-candidates-in-buffer (current-buffer) "location !cat ")
           (s-replace "\n" "" (s-collapse-whitespace (org-no-properties (car it))))))
#+END_SRC

#+RESULTS:
- **** Target positive: location 
- *** Match headings with multiple tags (targets (list ":yes:" "location" ":tag:" "notatag")))

#+BEGIN_SRC elisp
  (let ((pat "\\bcat\\b")
        (targets '("a cat sleeps" "a catastrophe" "what")))
    (mapit targets (when (string-match pat it)(match-string 0 it))))
#+END_SRC

#+RESULTS:
| cat | nil | nil |

...sigh.  Use =s-matches= not =s-contains=.  Duh.

#+BEGIN_SRC elisp
  (let ((pat "\\(\\_<\\|[[:punct:]]\\)cat\\(\\_>\\|[[:punct:]]\\)")
        (target "a cat sleeps"))
    (s-matches? pat target))
#+END_SRC

#+RESULTS:
: t

*** Without negation

#+BEGIN_SRC elisp :results value
  (profile-rifle 10 (helm-org-rifle-get-candidates-in-buffer (find-file-noselect "~/org/inbox.org") "emacs helm"))
#+END_SRC

#+RESULTS:
#+begin_example txt
helm-org-rifle-get-candidates-in-buffer                       10          3.090195806   0.3090195806
org-heading-components                                        1870        0.3476501630  0.0001859091
s-matches?                                                    12070       0.2892685670  2.396...e-05
helm-org-rifle-fontify-like-in-org-mode                       190         0.2818512350  0.0014834275
line-beginning-position                                       8850        0.2493933970  2.818...e-05
search-forward-regexp                                         6200        0.2002201670  3.229...e-05
org-do-latex-and-related                                      190         0.183021584   0.0009632714
string-match                                                  16180       0.1157849300  7.156...e-06
goto-char                                                     8080        0.1073119259  1.328...e-05
org-back-to-heading                                           1870        0.0820826830  4.389...e-05
outline-back-to-heading                                       1870        0.0757641679  4.051...e-05
outline-next-heading                                          1880        0.07128534    3.791...e-05
line-end-position                                             4330        0.0655929360  1.514...e-05
outline-previous-heading                                      1870        0.0335165519  1.792...e-05
org-at-heading-p                                              4330        0.0254124080  5.868...e-06
buffer-substring-no-properties                                8340        0.0160720620  1.927...e-06
outline-on-heading-p                                          6200        0.0159791459  2.577...e-06
mapcar                                                        2098        0.0149361860  7.119...e-06
s-trim                                                        1010        0.0134555670  1.332...e-05
s-join                                                        2450        0.0121108709  4.943...e-06
#+end_example



*** With negation
:PROPERTIES:
:ID:       413c432f-6c8a-4f41-bbd4-486d859fe571
:END:

#+BEGIN_SRC elisp :results value
  (profile-rifle 10 (helm-org-rifle-get-candidates-in-buffer (find-file-noselect "~/org/inbox.org") "emacs helm !mail"))
#+END_SRC

#+RESULTS:
#+begin_example txt
helm-org-rifle-get-candidates-in-buffer                       10          3.091637074   0.3091637074
org-heading-components                                        1670        0.4687531710  0.0002806905
buffer-substring-no-properties                                7070        0.2041990190  2.888...e-05
goto-char                                                     6800        0.1843262129  2.710...e-05
map                                                           1680        0.1841657830  0.0001096224
org-back-to-heading                                           1670        0.1832357559  0.0001097220
mapcar                                                        1728        0.1819894680  0.0001053179
car                                                           17102       0.1810326969  1.058...e-05
s-join                                                        1790        0.1791070739  0.0001000598
outline-back-to-heading                                       1670        0.1777289460  0.0001064245
mapconcat                                                     1820        0.1752004220  9.626...e-05
search-forward-regexp                                         3470        0.1643956769  4.737...e-05
outline-next-heading                                          1670        0.1309705520  7.842...e-05
line-beginning-position                                       5300        0.1271316750  2.398...e-05
line-end-position                                             3460        0.117448273   3.394...e-05
outline-previous-heading                                      1670        0.0792564969  4.745...e-05
s-contains?                                                   6740        0.0599737680  8.898...e-06
helm-org-rifle-prep-token                                     3490        0.0288021979  8.252...e-06
helm-org-rifle-fontify-like-in-org-mode                       40          0.0239840029  0.0005996000
string-match                                                  12220       0.0191793460  1.569...e-06
#+end_example

